/*---------------------------------------------------------------------
	Все функции, работающие с векторами, предполагают, что они
	представляют из себя массивы из 3-ех элементов типа double.
--------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------
	VEC_MUL
	Прототип:
		double* vec_mul( double* a, double* b, double* c )
	Функция производит векторное умножение вектора a на вектор b,
	помещая результат в c, который может с ними совпадать.
	Параметры:
	a	Левый сомножитель.
	b	Правый сомножитель.
	c	Указатель на вектор, куда будет помещен результат.
--------------------------------------------------------------------------*/
extern	double* vec_mul( double*, double*, double* );

/*--------------------------------------------------------------------------
	SCAL_MUL
	Прототип:
		double scal_mul( double* a, double* b )
	Функция производит скалярное умножение двух векторов.
	Параметры:
	a, b	Вектора-сомножители.
--------------------------------------------------------------------------*/
extern	double scal_mul( double* , double* );

/*--------------------------------------------------------------------------
	VEC_LEN
	Прототип:
		double vec_len( double *a )
	Функция вычисляет длину вектора.
--------------------------------------------------------------------------*/
extern	double vec_len( double* );

/*--------------------------------------------------------------------------
	VEC_NORM
	Прототип:
		void vec_norm( double* a )
	Функция нормирует вектор.
--------------------------------------------------------------------------*/
extern	void vec_norm( double* );

/*--------------------------------------------------------------------------
	VEC_COPY
	Прототип:
		void vec_copy( double *dst, double *src )
	Функция копирует вектор src в вектор dst.
--------------------------------------------------------------------------*/
extern	void vec_copy( double*, double* );

/*--------------------------------------------------------------------------
	VEC_ADD
	Прототип:
		double* vec_add( double* a, double* b, double* r )
	Функция суммирует вектора a и b, помещая результат в r.
--------------------------------------------------------------------------*/
extern	double* vec_add( double*, double*, double* );

/*--------------------------------------------------------------------------
	VEC_SUB
	Прототип:
		double* vec_sub( double* a, double* b, double* r )
	Функция вычитает вектора a и b, помещая результат в r.
--------------------------------------------------------------------------*/
extern	double* vec_sub( double*, double*, double* );

/*--------------------------------------------------------------------------
	VEC_NUM_MUL
	Прототип:
		double* vec_num_mul( double* a, double num, double* r )
	Функция умножает вектор a на число num, помещая результат в r.
--------------------------------------------------------------------------*/
extern	double* vec_num_mul( double*, double, double* );
