/*-------------------------------------------------------------------------
	c_const.hpp
	Константы.
		21 янв 2009
			Параметры эллипсоида перенесены в orbmodel/include/orbconst.h
			PI, RD и DR определенны через #define,
			а не через "const double" как ранее.
-------------------------------------------------------------------------*/
#ifndef _C_CONST_HPP_
#define _C_CONST_HPP_

#define PI      3.141592653589793238463
//#define PI      3.14159265
//#define PI      3.1415926
#define RD      (180.0/PI)      /* Множитель перевода радиан в градусы. */
#define DR      (PI/180.0)      /* Множитель перевода градусов в радианы. */

#endif
